driver-tests/bpelse/assign/AssignJbi/test/results/echoFloatDataType_Invoke/Actual_20130318180051_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="http://stc.com/echoFloatDataType" xmlns:msgns="http://stc.com/echoFloatDataType">
      <string>1.5E2</string>
      <normalizedString>1.5E2</normalizedString>
      <token>1.5E2</token>
      <base64Binary>1.5E2</base64Binary>
      <hexBinary>1.5E2</hexBinary>
      <integer>1.5E2</integer>
      <positiveInteger>1.5E2</positiveInteger>
      <negativeInteger>1.5E2</negativeInteger>
      <nonNegativeInteger>1.5E2</nonNegativeInteger>
      <nonPositiveInteger>1.5E2</nonPositiveInteger>
      <long>1.5E2</long>
      <unsignedLong>1.5E2</unsignedLong>
      <int>1.5E2</int>
      <unsignedInt>1.5E2</unsignedInt>
      <short>1.5E2</short>
      <unsignedShort>1.5E2</unsignedShort>
      <byte>1.5E2</byte>
      <unsignedByte>1.5E2</unsignedByte>
      <decimal>1.5E2</decimal>
      <float>1.5E2</float>
      <double>1.5E2</double>
      <boolean>1.5E2</boolean>
      <duration>1.5E2</duration>
      <dateTime>1.5E2</dateTime>
      <date>1.5E2</date>
      <time>1.5E2</time>
      <gYear>1.5E2</gYear>
      <gYearMonth>1.5E2</gYearMonth>
      <gMonth>1.5E2</gMonth>
      <gMonthDay>1.5E2</gMonthDay>
      <gDay>1.5E2</gDay>
      <Name>1.5E2</Name>
      <QName>1.5E2</QName>
      <NCName>1.5E2</NCName>
      <anyURI>1.5E2</anyURI>
      <language>1.5E2</language>
      <ID>1.5E2</ID>
      <IDREF>1.5E2</IDREF>
      <IDREFS>1.5E2</IDREFS>
      <ENTITY>1.5E2</ENTITY>
      <ENTITIES>1.5E2</ENTITIES>
      <NMTOKEN>1.5E2</NMTOKEN>
      <NMTOKENS>1.5E2</NMTOKENS>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>